In [ ]:
#week_23 - Is it the teacher or the student? Part I

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame()

In [3]:
data_dict = pd.read_excel('Student Input.xlsx',sheet_name = None)

In [4]:
data_dict.keys()

dict_keys(['Student Info', 'Results'])

In [5]:
stud_info = pd.read_excel('Student Input.xlsx',sheet_name = 'Student Info')

In [6]:
stud_info.head(5)

    Student ID    Full name            Gender    Class
0             1   Alice Johnson        Female    10A
1             2   Bob Smith            Male      9B
2             3   Cathy Lee            Female    11C
3             4   David Chen           Male      10A
4             5   Emily Wang           Female    9B

In [7]:
stud_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0    Student ID          50 non-null     int64
 1    Full name           50 non-null     object
 2    Gender              50 non-null     object
 3    Class               50 non-null     object
dtypes: int64(1), object(3)
memory usage: 1.7+ KB

In [8]:
stud_info.shape

(50, 4)

In [9]:
stud_res = pd.read_excel('Student Input.xlsx',sheet_name = 'Results')

In [10]:
stud_res.head(5)

   Student ID  English  Economics  Psychology
0           1       88         66          72
1           2       76         67          66
2           3       93         54          66
3           4       85         63          67
4           5       64         57          62

In [11]:
stud_res.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Student ID  50 non-null     int64
 1   English     50 non-null     int64
 2   Economics   50 non-null     int64
 3   Psychology  50 non-null     int64
dtypes: int64(4)
memory usage: 1.7 KB

In [12]:
stud_res.shape

(50, 4)

In [13]:
stud_info.columns

Index([' Student ID ', ' Full name         ', ' Gender ', ' Class '], dtype='object')

In [14]:
stud_info.rename(columns = {' Student ID ':'Student ID'},inplace = True)

In [15]:
stud_res.columns

Index(['Student ID', 'English', 'Economics', 'Psychology'], dtype='object')

In [16]:
data = stud_info.merge(stud_res, how = 'inner',on = 'Student ID')

In [17]:
data.head(5)

,Student ID,Full name,Gender,Class,English,Economics,Psychology
0,1,Alice Johnson,Female,10A,88,66,72
1,2,Bob Smith,Male,9B,76,67,66
2,3,Cathy Lee,Female,11C,93,54,66
3,4,David Chen,Male,10A,85,63,67
4,5,Emily Wang,Female,9B,64,57,62

In [18]:
data.columns

Index(['Student ID', ' Full name         ', ' Gender ', ' Class ', 'English',
       'Economics', 'Psychology'],
      dtype='object')

In [19]:
#Aggregate to get the average grade per class for each subject


sam = data.groupby([' Class '])[['English','Economics','Psychology']].mean()

In [20]:
sam['English'].min()

68.2

In [21]:
sam['Economics'].min()

52.4

In [22]:
sam['Psychology'].min()

59.6

In [23]:
sam

         English  Economics  Psychology
 Class
 10A        70.8       60.4        62.1
 10B        77.2       54.0        70.6
 11A        78.0       57.6        61.4
 11C        79.1       55.2        62.9
 9A         68.2       53.5        60.9
 9B         73.4       52.4        59.6

In [24]:
sam.reset_index(inplace = True)

In [25]:
sam

    Class   English  Economics  Psychology
0   10A        70.8       60.4        62.1
1   10B        77.2       54.0        70.6
2   11A        78.0       57.6        61.4
3   11C        79.1       55.2        62.9
4       9A     68.2       53.5        60.9
5   9B         73.4       52.4        59.6

In [26]:
sam.columns

Index([' Class ', 'English', 'Economics', 'Psychology'], dtype='object')

In [27]:
final = pd.melt(sam, id_vars=' Class ', var_name='Subject', value_name='Grade')

In [28]:
final.head(5)

    Class   Subject  Grade
0   10A     English   70.8
1   10B     English   77.2
2   11A     English   78.0
3   11C     English   79.1
4       9A  English   68.2

In [29]:
final.columns

Index([' Class ', 'Subject', 'Grade'], dtype='object')

In [30]:
final['rank']=final.groupby('Subject')['Grade'].rank()

In [31]:
final.sort_values(by = 'rank',ascending = True,inplace = True)

In [32]:
final

     Class      Subject  Grade  rank
17   9B      Psychology   59.6   1.0
11   9B       Economics   52.4   1.0
4        9A     English   68.2   1.0
10       9A   Economics   53.5   2.0
16       9A  Psychology   60.9   2.0
0    10A        English   70.8   2.0
7    10B      Economics   54.0   3.0
14   11A     Psychology   61.4   3.0
5    9B         English   73.4   3.0
9    11C      Economics   55.2   4.0
1    10B        English   77.2   4.0
12   10A     Psychology   62.1   4.0
2    11A        English   78.0   5.0
15   11C     Psychology   62.9   5.0
8    11A      Economics   57.6   5.0
6    10A      Economics   60.4   6.0
3    11C        English   79.1   6.0
13   10B     Psychology   70.6   6.0

In [33]:
cols = ['Subject','Grade',' Class ']

final = final.reindex(columns = cols)

In [34]:
final.head(3)

       Subject  Grade   Class
17  Psychology   59.6   9B
11   Economics   52.4   9B
4      English   68.2       9A